{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "pink primrose",
    "1": "hard-leaved pocket orchid",
    "2": "canterbury bells",
    "3": "sweet pea",
    "4": "wild geranium",
    "5": "tiger lily",
    "6": "moon orchid",
    "7": "bird of paradise",
    "8": "monkshood",
    "9": "globe thistle",
    "10": "snapdragon",
    "11": "colt's foot",
    "12": "king protea",
    "13": "spear thistle",
    "14": "yellow iris",
    "15": "globe-flower",
    "16": "purple coneflower",
    "17": "peruvian lily",
    "18": "balloon flower",
    "19": "giant white arum lily",
    "20": "fire lily",
    "21": "pincushion flower",
    "22": "fritillary",
    "23": "red ginger",
    "24": "grape hyacinth",
    "25": "corn poppy",
    "26": "prince of wales feathers",
    "27": "stemless gentian",
    "28": "artichoke",
    "29": "sweet william",
    "30": "carnation",
    "31": "garden phlox",
    "32": "love in the mist",
    "33": "cosmos",
    "34": "alpine sea holly",
    "35": "ruby-lipped cattleya",
    "36": "cape flower",
    "37": "great masterwort",
    "38": "siam tulip",
    "39": "lenten rose",
    "40": "barberton daisy",
    "41": "daffodil",
    "42": "sword lily",
    "43": "poinsettia",
    "44": "bolero deep blue",
    "45": "wallflower",
    "46": "marigold",
    "47": "buttercup",
    "48": "daisy",
    "49": "common dandelion",
    "50": "petunia",
    "51": "wild pansy",
    "52": "primula",
    "53": "sunflower",
    "54": "lilac hibiscus",
    "55": "bishop of llandaff",
    "56": "gaura",
    "57": "geranium",
    "58": "orange dahlia",
    "59": "pink-yellow dahlia",
    "60": "cautleya spicata",
    "61": "japanese anemone",
    "62": "black-eyed susan",
    "63": "silverbush",
    "64": "californian poppy",
    "65": "osteospermum",
    "66": "spring crocus",
    "67": "iris",
    "68": "windflower",
    "69": "tree poppy",
    "70": "gazania",
    "71": "azalea",
    "72": "water lily",
    "73": "rose",
    "74": "thorn apple",
    "75": "morning glory",
    "76": "passion flower",
    "77": "lotus",
    "78": "toad lily",
    "79": "anthurium",
    "80": "frangipani",
    "81": "clematis",
    "82": "hibiscus",
    "83": "columbine",
    "84": "desert-rose",
    "85": "tree mallow",
    "86": "magnolia",
    "87": "cyclamen ",
    "88": "watercress",
    "89": "canna lily",
    "90": "hippeastrum ",
    "91": "bee balm",
    "92": "pink quill",
    "93": "foxglove",
    "94": "bougainvillea",
    "95": "camellia",
    "96": "mallow",
    "97": "mexican petunia",
    "98": "bromelia",
    "99": "blanket flower",
    "100": "trumpet creeper",
    "101": "blackberry lily",
    "102": "common tulip",
    "103": "wild rose"
  },
  "image_size": 331,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "alpine sea holly": 34,
    "anthurium": 79,
    "artichoke": 28,
    "azalea": 71,
    "balloon flower": 18,
    "barberton daisy": 40,
    "bee balm": 91,
    "bird of paradise": 7,
    "bishop of llandaff": 55,
    "black-eyed susan": 62,
    "blackberry lily": 101,
    "blanket flower": 99,
    "bolero deep blue": 44,
    "bougainvillea": 94,
    "bromelia": 98,
    "buttercup": 47,
    "californian poppy": 64,
    "camellia": 95,
    "canna lily": 89,
    "canterbury bells": 2,
    "cape flower": 36,
    "carnation": 30,
    "cautleya spicata": 60,
    "clematis": 81,
    "colt's foot": 11,
    "columbine": 83,
    "common dandelion": 49,
    "common tulip": 102,
    "corn poppy": 25,
    "cosmos": 33,
    "cyclamen ": 87,
    "daffodil": 41,
    "daisy": 48,
    "desert-rose": 84,
    "fire lily": 20,
    "foxglove": 93,
    "frangipani": 80,
    "fritillary": 22,
    "garden phlox": 31,
    "gaura": 56,
    "gazania": 70,
    "geranium": 57,
    "giant white arum lily": 19,
    "globe thistle": 9,
    "globe-flower": 15,
    "grape hyacinth": 24,
    "great masterwort": 37,
    "hard-leaved pocket orchid": 1,
    "hibiscus": 82,
    "hippeastrum ": 90,
    "iris": 67,
    "japanese anemone": 61,
    "king protea": 12,
    "lenten rose": 39,
    "lilac hibiscus": 54,
    "lotus": 77,
    "love in the mist": 32,
    "magnolia": 86,
    "mallow": 96,
    "marigold": 46,
    "mexican petunia": 97,
    "monkshood": 8,
    "moon orchid": 6,
    "morning glory": 75,
    "orange dahlia": 58,
    "osteospermum": 65,
    "passion flower": 76,
    "peruvian lily": 17,
    "petunia": 50,
    "pincushion flower": 21,
    "pink primrose": 0,
    "pink quill": 92,
    "pink-yellow dahlia": 59,
    "poinsettia": 43,
    "primula": 52,
    "prince of wales feathers": 26,
    "purple coneflower": 16,
    "red ginger": 23,
    "rose": 73,
    "ruby-lipped cattleya": 35,
    "siam tulip": 38,
    "silverbush": 63,
    "snapdragon": 10,
    "spear thistle": 13,
    "spring crocus": 66,
    "stemless gentian": 27,
    "sunflower": 53,
    "sweet pea": 3,
    "sweet william": 29,
    "sword lily": 42,
    "thorn apple": 74,
    "tiger lily": 5,
    "toad lily": 78,
    "tree mallow": 85,
    "tree poppy": 69,
    "trumpet creeper": 100,
    "wallflower": 45,
    "water lily": 72,
    "watercress": 88,
    "wild geranium": 4,
    "wild pansy": 51,
    "wild rose": 103,
    "windflower": 68,
    "yellow iris": 14
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0"
}
